belak/zsh-utils path:completion

zsh-users/zsh-completions
Aloxaf/fzf-tab
Freed-Wu/fzf-tab-source
lukechilds/zsh-better-npm-completion
dim-an/cod kind:path
zsh-users/zsh-autosuggestions
lukechilds/zsh-better-npm-completion


belak/zsh-utils path:utility
belak/zsh-utils path:prompt

jirutka/zsh-shift-select

catppuccin/zsh-fsh kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer

onyxraven/zsh-osx-keychain
